app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "micropost_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "m"], ["micropost_id", 289], ["user_id", 102], ["created_at", "2016-09-30 05:54:51.657492"], ["updated_at", "2016-09-30 05:54:51.657492"]]
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = 289  ORDER BY created_at DESC
---
  def create
    @comment = @micropost.comments.create(params[:comment].permit(:content))
    @comments = Comment.where(micropost_id: @micropost).order('created_at DESC')

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ?  ORDER BY "microposts"."created_at" DESC LIMIT 1  [["id", 295]]
---
def find_post
    @micropost = Micropost.find(params[:micropost_id])