app/controllers/microposts_controller.rb

  def show
    @micropost = Micropost.find(params[:id])
    @comments = Comment.where(micropost_id: @micropost).order('created_at DESC')
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ?  ORDER BY "microposts"."created_at" DESC LIMIT 1  [["id", 295]]
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = 295  ORDER BY created_at DESC

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "2222222222"], ["title", "11111111"], ["user_id", 1], ["created_at", "2016-09-29 16:37:51.257910"], ["updated_at", "2016-09-29 16:37:51.257910"]]