app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], :per_page => 6)
---
SELECT  "users".* FROM "users"  ORDER BY "users"."created_at" DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."created_at" DESC LIMIT 1  [["id", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  ORDER BY "microposts"."created_at" DESC LIMIT 10 OFFSET 0  [["user_id", 101]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 101]]

  def edit
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."created_at" DESC LIMIT 1  [["id", 101]]

  def following
    @title = "Following"
    @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."created_at" DESC LIMIT 1  [["id", 101]]

  def followers
    @title = "Followers"
    @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."created_at" DESC LIMIT 1  [["id", 101]]